# 6.	Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

print(chr(ord('a')+(int(input('введите номер буквы:'))-1)))
